[
  {
    "type": "Workshop",
    "day": "Friday",
    "order": "1",
    "time": "9:00am - 12:30pm",
    "title": "Full Stack Data Science: Building Your First Smart Application ",
    "speaker": "Chris Luiz",
    "blurb": "This workshop delivers value for beginners, web developers, and data scientists via an intro to the Python scientific and data analysis stack, Flask, data acquisition/processing, and a means to knit them together. It is widely accessible and touches on several interests of the community.",
    "linkedin_profile": "https://www.linkedin.com/in/christopher-luiz/",
    "headshot": "luiz_headshot.jpeg"
  },
  {
    "type": "Workshop",
    "day": "Friday",
    "order": "2",
    "time": "1:00pm - 4:30pm",
    "title": "Iterators, generators, coroutines and asyncio",
    "speaker": "Uche Ogbuji",
    "blurb": "Python developers should learn effective use of the iterator protocol when crunching large datasets. The lineage of such techniques extends to Python 3’s asyncio, valuable in boosting network applications. This workshop progresses from a firm grounding in iterators through generators & asyncio.",
    "linkedin_profile": "https://www.linkedin.com/in/ucheogbuji/",
    "headshot": "ogbuji_headshot.jpeg"
  },
  {
    "type": "Keynote",
    "day": "Saturday",
    "order": "3",
    "time": "9:30am - 10:10am",
    "title": "Untitled",
    "speaker": "Ewa Jodlowska",
    "blurb": "?",
    "linkedin_profile": "https://www.linkedin.com/in/ewa-jodlowska-39810611/",
    "headshot": "jodlowska_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "4",
    "time": "10:20am - 10:50am",
    "title": "Developing With Empathy ",
    "speaker": "Rami Chowdhury",
    "blurb": "Building software is a team sport, we’re told. Yet it’s cooperation that makes teams work, and without empathy we can’t cooperate. This talk looks at adding care to our code and raising the bar beyond \"just come talk to me if you have a problem\".",
    "linkedin_profile": "https://www.linkedin.com/in/ramichowdhury/",
    "headshot": "chowdhury_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "5",
    "time": "11:00am - 11:30am",
    "title": "Pandas May Be Slow, but Pandas Doesn't Have to Be",
    "speaker": "Andrew Vaccaro",
    "blurb": "Python is quickly becoming the de-facto language of data science. Pandas is one of the most popular libraries for managing and transforming data, but many users are unaware of strategies to tune pandas for performance. Simple changes can greatly speed up data processing when applied correctly.",
    "linkedin_profile": "https://www.linkedin.com/in/andrew-vaccaro-510187103/",
    "headshot": "vaccaro_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "6",
    "time": "11:40am - 12:10pm",
    "title": "Boring Object Orientation",
    "speaker": "Moshe Zadka",
    "blurb": "The strengths and weaknesses of Python lend themselves to a different style of object oriented programming. By accepting several constraints on how we design and implement classes, we make our code more robust, more testable, and easier to adapt to changing circumstances",
    "linkedin_profile": "https://www.linkedin.com/in/moshezadka/",
    "headshot": "zadka_headshot.jpg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "7",
    "time": "2:10pm - 2:40pm",
    "title": "Optimizing SQL + Python Pipelines for Data Science",
    "speaker": "Jordan Hagan",
    "blurb": "Poorly written SQL and Python can make data extraction and manipulation tedious and painful. Streamlined processes utilizing SQL best practices will save hours of frustration. My goal is to teach attendees proven SQL methodologies and what python tools to use when.",
    "linkedin_profile": "https://www.linkedin.com/in/jordanhhagan/",
    "headshot": "hagan_headshot.jpg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "8",
    "time": "2:50pm - 3:20pm",
    "title": "Unleashing the Eighth Plague: An Intro to Load Testing with Locust and Python",
    "speaker": "Gabriel Boorse",
    "blurb": "Puzzling over performance problems in production? Baffling backend bugs bending your brain? Unleash a plague of Locusts on your web app to devour performance problems, permanently! In this talk, you will learn how to leverage Locust for load testing RESTful services and more.",
    "linkedin_profile": "https://www.linkedin.com/in/gabrielboorse/",
    "headshot": "boorse_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "9",
    "time": "3:50pm - 4:20pm",
    "title": "Stats Don't Have to Be Scary: Automatic a/b Test Analysis Using Python",
    "speaker": "Kristie Wirth",
    "blurb": "Learn how my workplace manages to analyze dozens of concurrent A/B tests with millions of data points! I’ll discuss our previous manual analysis process, some things that have changed, and do a down-to-earth walkthrough of how you too can use Python to automate analyzing your tests.",
    "linkedin_profile": "https://www.linkedin.com/in/kristiewirth/",
    "headshot": "wirth_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "10",
    "time": "4:30pm - 5:00pm",
    "title": "Getting started with gRPC-Web and Python",
    "speaker": "Flavia Bastos",
    "blurb": "In this talk, we will explore what gRPC is and its application in web development. We will walk through an implementation of a Python server and a JS client communicating via gRPC.",
    "linkedin_profile": "https://www.linkedin.com/in/flavia-bastos-developer/",
    "headshot": "bastos_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Saturday",
    "order": "11",
    "time": "5:10pm - 5:40pm",
    "title": "Using Dask to Distribute Machine Learning Jobs",
    "speaker": "William Cox",
    "blurb": "Dask is a light-weight, Pythonic, library for doing distributed computation. I’ll talk about how we use it to run machine learning forecasting jobs, and how the library might benefit your machine learning or data science work.",
    "linkedin_profile": "https://www.linkedin.com/in/williamcox/",
    "headshot": "cox_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Sunday",
    "order": "12",
    "time": "9:30am - 10:10am",
    "title": "Cleaning Up Your Python Environment Superfund Site",
    "speaker": "Ashton Honnecke",
    "blurb": "Does your Python environment look like Randall Munroe's (of XKCD fame) Python environment superfund site? (https://xkcd.com/1987/)\n\nWhat would happen to your sprint if your laptop got hit by a bus?\n\nHow can you mitigate that?",
    "linkedin_profile": "https://www.linkedin.com/in/ashtonhonnecke/",
    "headshot": "honnecke_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Sunday",
    "order": "13",
    "time": "10:20am - 10:50am",
    "title": "Using Dash to Create Interactive Web Apps for Non-Technical Audiences",
    "speaker": "Joseph Willi",
    "blurb": "Ever struggle with finding methods to present data visualizations and/or results to non-technical audiences in a coherent and engaging manner? In this talk, I’ll detail how I overcame such a challenge by using Dash to build an interactive app for firefighters to use while testing rescue equipment.",
    "linkedin_profile": "https://www.linkedin.com/in/joseph-willi-38b7883b/",
    "headshot": "willi_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Sunday",
    "order": "14",
    "time": "11:00am - 11:30am",
    "title": "WhyPy? Understanding Trends Driving the Usage of Python ",
    "speaker": "Rachel Stephens",
    "blurb": "How does Python fit among programming languages? We’ll start with a zoomed out view of programming language trends and then drill into Python specifically. Our goal is to explore where, why and how Python being used, and then discuss future opportunities and threats to the language.",
    "linkedin_profile": "https://www.linkedin.com/in/rachelstephens/",
    "headshot": "stephens_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Sunday",
    "order": "15",
    "time": "1:20pm - 1:50pm",
    "title": "Advanced asyncio: Solving Real-World Production Problems",
    "speaker": "Lynn Root",
    "blurb": "Everyone’s talking about it. Everyone’s using it. But most likely, they’re doing it wrong, just like we did.\n\nBy building a simplified chaos monkey service, we will walk through how to create a good foundation for an asyncio-based service, including graceful shutdowns, proper exception handling, and testing asynchronous code. We’ll get into the hairier topics as well, covering topics like working with synchronous code, debugging and profiling, and working with threaded code. We’ll learn how to approach asynchronous and concurrent programming with Python’s asyncio library, take away some best practices, and learn what pitfalls to avoid.",
    "linkedin_profile": "https://www.linkedin.com/in/lynnroot/",
    "headshot": "root_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Sunday",
    "order": "16",
    "time": "2:00pm - 2:30pm",
    "title": "CUDA in Your Python: Effective Parallel Programming on the GPU",
    "speaker": "William Horton",
    "blurb": "It’s 2019, and Moore’s Law is dead. CPU performance is plateauing, but GPUs provide a chance for continued hardware performance gains, if you can structure your programs to make good use of them. In this talk you will learn how to speed up your Python programs using Nvidia’s CUDA platform.",
    "linkedin_profile": "https://www.linkedin.com/in/wdhorton/",
    "headshot": "horton_headshot.jpeg"
  },
  {
    "type": "Regular Talk",
    "day": "Sunday",
    "order": "17",
    "time": "3:00pm - 3:30pm",
    "title": "Static Typing in Python ",
    "speaker": "Dustin Ingram",
    "blurb": "In this talk, we’ll discuss the advantages and disadvantages to a static type system, as well as recent efforts to introduce static typing to Python via optional “type hints” and various tools to aid in adding types to Python code.",
    "linkedin_profile": "https://www.linkedin.com/in/dustingram/",
    "headshot": "ingram_headshot.png"
  },
  {
    "type": "Keynote",
    "day": "Sunday",
    "order": "18",
    "time": "4:30pm - 5:10pm",
    "title": "Python 1994 ",
    "speaker": "Paul Everitt",
    "blurb": "“Come for the language, stay for the community.” The Python community started in 1994 at a NIST workshop in Maryland. What was the world of Python like in its first years? Did we have any clue whatsoever? A joke-focused tour of early Python, heavy on question-and-answer.",
    "linkedin_profile": "https://www.linkedin.com/in/paeveritt/",
    "headshot": "everitt_headshot.jpeg"
  }
]
