[
  {
     "name":"William Cox",
     "avatar":"https://secure.gravatar.com/avatar/159eab465191c050821e4337b692a27a?s=500",
     "location":"Unknown",
     "bio":"William is a machine learning engineer at Grubhub. He enjoy building production machine learning systems.",
     "twitter":"gallamine",
     "url":"http://www.gallamine.com",
     "organization":"Grubhub",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Using Dask to Distribute Machine Learning Jobs",
     "abstract":"Dask is a light-weight, Pythonic, library for doing distributed computation. I'll talk about how we use it to run machine learning forecasting jobs, and how the library might benefit your machine learning or data science work.",
     "audience_level":"Intermediate",
     "tags":[
        "data science",
        "machine learning",
        "Python"
     ],
     "state":"accepted",
     "confirmed":false,
     "created_at":"2019-05-15T21:26:17.094Z",
     "additional_info":null
  },
  {
     "name":"Ashton Honnecke",
     "avatar":"https://secure.gravatar.com/avatar/ab2e16fcec902eef840c6a676c95c4ab?s=500",
     "location":"Unknown",
     "bio":"I hate having to click on things.  I hate having to do anything twice.  I hate breaking stuff.\r\nI'm lazy and I want to automate everything and then some.  The hardest thing to wean a developer off of is several pages of \"to develop locally\" README.\r\nDon't trust the README, trust the code.",
     "twitter":"",
     "url":"https://github.com/ahonnecke",
     "organization":"Digital Assets Data",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Cleaning up your python environment superfund site.",
     "abstract":"Does your python environment look like randall munroe's (of XKCD fame) python environment superfund site? (https://xkcd.com/1987/)\n\nWhat would happen to your sprint if your laptop got hit by a bus?\n\nHow can you mitigate that?",
     "audience_level":"Intermediate",
     "tags":[
        "pipenv",
        "docker",
        "docker-compose",
        "sqlalchemy",
        "alembic",
        "pytest",
        "web development",
        "devops",
        "testing"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-15T23:30:08.014Z",
     "additional_info":null
  },
  {
     "name":"William Horton",
     "avatar":"https://secure.gravatar.com/avatar/a1225054c221cedf3635ba79582c8768?s=500",
     "location":"Unknown",
     "bio":"William Horton is a Backend Engineer at Compass, where he works on systems for ingesting, processing, and serving millions of real estate listings. In his spare time, he blogs and speaks about deep learning, contributes to open-source libraries like fastai and pytorch, and competes in computer vision competitions on Kaggle. When he's not doing tech things, he enjoys powerlifting and singing a cappella.",
     "twitter":"hortonhearsafoo",
     "url":"",
     "organization":"Compass",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"CUDA in your Python: Effective Parallel Programming on the GPU",
     "abstract":"It's 2019, and Moore's Law is dead. CPU performance is plateauing, but GPUs provide a chance for continued hardware performance gains, if you can structure your programs to make good use of them. In this talk you will learn how to speed up your Python programs using Nvidia's CUDA platform.",
     "audience_level":"All",
     "tags":[

     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-17T02:57:56.773Z",
     "additional_info":null
  },
  {
     "name":"Dustin Ingram",
     "avatar":"https://secure.gravatar.com/avatar/e5cc71215389f7c74b1f459e1ee52c42?s=500",
     "location":"Austin, TX",
     "bio":"I'm Dustin (aka [@di](<https://github.com/di>)), a Developer Advocate at Google, focused on supporting the Python community on the Google Cloud Platform. I'm also a member of the [Python Packaging Authority](https://github.com/orgs/pypa/people), maintainer of the [Python Package Index](https://pypi.org/), and organizer for the [PyTexas](https://www.pytexas.org) conference.",
     "twitter":"di_codes",
     "url":"https://di.codes",
     "organization":"Google",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Static Typing in Python",
     "abstract":"In this talk, we'll discuss the advantages and disadvantages to a static type system, as well as recent efforts to introduce static typing to Python via optional \"type hints\" and various tools to aid in adding types to Python code.",
     "audience_level":"All",
     "tags":[

     ],
     "state":"accepted",
     "confirmed":false,
     "created_at":"2019-05-13T02:30:36.435Z",
     "additional_info":null
  },
  {
     "name":"Jeremy Schendel",
     "avatar":"https://secure.gravatar.com/avatar/01711cc34e20fd249cf259e5ca8e094f?s=500",
     "location":"Unknown",
     "bio":"Jeremy Schendel is a data scientist and software engineer in Denver who enjoys building tools that help empower data scientists. He is an open source contributor and one of the core developers of pandas, a major library in the Python ecosystem used for data analysis.",
     "twitter":"",
     "url":"",
     "organization":"NextHealth Technologies",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"pandas .head() to .tail()",
     "abstract":"An introduction to pandas, a library providing data structures and algorithms for tabular data analysis. We'll focus on the core features of pandas, which handles most data munging tasks. Emphasis will be on practical applications, illustrating solutions to common problems using real-world data.",
     "audience_level":"Beginner",
     "tags":[
        "pandas",
        "data science",
        "data analysis",
        "Python",
        "workshop"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-16T14:55:02.155Z",
     "additional_info":null
  },
  {
     "name":"Kojo Idrissa",
     "avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/12002/IMG_7131.JPG",
     "location":"Houston, TX",
     "bio":"Kojo Idrissa *was* an accountant who got an MBA and taught at university in two different countries. He's *now* a  software engineer, international tech conference speaker, DjangoCon US organizer and the [DEFNA](https://www.defna.org/) North American Ambassador ([#NorAmGT](https://twitter.com/search?q=%23NorAmGT&src=tyah)). He's spoken at tech conferences about software engineering practices, spreadsheets, contributing to tech communities, Dungeons & Dragons, inclusion and privilege. You can find him online at http://kojoidrissa.com/ or as [@transition](https://twitter.com/Transition) on Twitter.\r\n",
     "twitter":"Transition",
     "url":"http://kojoidrissa.com/",
     "organization":"Decisio Health",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"Learning Practical Python",
     "abstract":"If you want to learn to program, but not become a professional developer, this tutorial is for you! First, we'll learn Python fundamentals. Next, we'll apply those skills to working with spreadsheets, a common task faced by many. You'll leave with tools to solve a wide range of your own problems.",
     "audience_level":"Beginner",
     "tags":[
        "Python",
        "spreadsheets",
        "OpenPyXL",
        "beginner"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-08T16:02:10.674Z",
     "additional_info":null
  },
  {
     "name":"Kristie Wirth",
     "avatar":"https://secure.gravatar.com/avatar/9c56531b550a37149db24103f9c0b396?s=500",
     "location":"Unknown",
     "bio":"Kristie is a self-proclaimed \"technical translator\" and revels in the challenge of communicating data science work to any level audience. You'll find her working as a Data Scientist at Zapier, where she recently developed a series of experimentation related tools, including detailed experiment analysis with the click of a button. Previously, she taught several classes on machine learning and visualization techniques at Galvanize. Her love of learning extends into her personal life, so you will often find her in the midst of taking a class on just about any topic ranging from improv comedy to swing dancing.",
     "twitter":"",
     "url":"https://www.linkedin.com/in/kristiewirth/",
     "organization":"Zapier",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Stats don't have to be scary: automatic A/B test analysis using Python",
     "abstract":"Learn how my workplace manages to analyze dozens of concurrent A/B tests with millions of data points! I'll discuss our previous manual analysis process, some things that have changed, and do a down-to-earth walkthrough of how you too can use Python to automate analyzing your tests.",
     "audience_level":"All",
     "tags":[
        "Python",
        "data science",
        "machine learning",
        "a/b testing"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-08T01:00:09.663Z",
     "additional_info":null
  },
  {
     "name":"Rami Chowdhury",
     "avatar":"https://secure.gravatar.com/avatar/f470b96c2b99ecaf489c1afd45d60a4c?s=500",
     "location":"Unknown",
     "bio":"Now working for his fifth startup disrupting his fourth industry, Rami has spent a lot of time over the last five years trying to convince people that DC has a real tech scene. As a principal engineer at Upside Travel and local Python meetup organizer, he's also spent a lot of time puzzling through other people's code and working with other developers of various levels to make software more accessible to everyone. In his spare time he likes to add his own twist to recipes and relax with a (paper) book.",
     "twitter":"necaris",
     "url":"https://necaris.net",
     "organization":"Upside Travel",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Developing With Empathy",
     "abstract":"Building software is a team sport, we're told. Yet it's cooperation that makes teams work, and without empathy we can't cooperate. I'll talk about adding care to our code, and raising the bar beyond \"just come talk to me if you have a problem\".",
     "audience_level":"All",
     "tags":[
        "philosophy",
        "best practices"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-17T02:57:16.406Z",
     "additional_info":null
  },
  {
     "name":"Ryan May",
     "avatar":"https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/23826/rmay_2019_400_01.jpg",
     "location":"Boulder, CO",
     "bio":"A radar meteorologist who decided that writing software is better than writing papers. Plotting a course for meteorology/world domination with Python.",
     "twitter":"dopplershift",
     "url":"https://github.com/dopplershift",
     "organization":"UCAR/Unidata",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Move Quickly and Don't Break Things: Testing Scientific Code",
     "abstract":"Testing is a safety harness for programming; it allows making changes with less fear. It can also feel intimidating to get started. This talk focuses on using PyTest, NumPy, and pytest-mpl to test scientific Python code. If you've ever wanted to get started testing your code, this talk will help.",
     "audience_level":"Intermediate",
     "tags":[
        "testing",
        "Python",
        "data science"
     ],
     "state":"accepted",
     "confirmed":false,
     "created_at":"2019-05-17T00:26:31.944Z",
     "additional_info":null
  },
  {
     "name":"Uche Ogbuji",
     "avatar":"https://secure.gravatar.com/avatar/d4aee6e9dca9f6cf4ba52e78081a9093?s=500",
     "location":"Superior, CO",
     "bio":"Uche Ogbuji, more properly Úchèńnà Ogbújí, was born in Calabar, Nigeria. He lived in Egypt, England and elsewhere before settling near Boulder, Colorado. He is an Electronic Engineer by education, having started his courses in Nigeria before transferring and graduating in the US. He is co-founder and CTO of Zepheira, which develops technological solutions to increase libraries' relevance on the Web. Uche has pioneered work data architecture and distributed systems for almost three decades, including early contributions to XML, Linked Data and Web services, having published hundreds of technical articles in industry journals such as IBM developerWorks, Application Development Trends & XML.com.\r\n\r\nUche is also a poet and spoken word performer. His poetry chapbook, *[Ndewo, Colorado](http://uche.ogbuji.net/ndewo)* is a Colorado Book Award Winner, and a [Westword Award Winner (\"Best Environmental Poetry\")](http://www.westword.com/best-of/2015/arts-and-entertainment/best-environmental-poetry-6611142). His poems, published worldwide, fuse Igbo culture, European classicism, American Mountain West setting, and Hip-Hop.",
     "twitter":"uogbuji",
     "url":"http://uche.ogbuji.net/",
     "organization":"Zepheira",
     "talk_format":"Lightning Talk (~5-10 minutes)",
     "title":"Python, Poetry and Hip-Hop Performance",
     "abstract":"Who said geeks can't have themselves a fly cypher? This live performance will lift the mood with a combination of spoken word poetry and hip-hop on Python-related topics, almost entirely improvised, including topics called out by the audience. Channeling the Zen of Python, with a gangsta lean!",
     "audience_level":"All",
     "tags":[
        "Python",
        "arts",
        "performance",
        "music",
        "poetry",
        "humor",
        "entertainment",
        "fun"
     ],
     "state":"accepted",
     "confirmed":false,
     "created_at":"2019-05-16T15:33:55.194Z",
     "additional_info":null
  },
  {
     "name":"Trey Hunner",
     "avatar":"https://secure.gravatar.com/avatar/93a988bd85040f58f8417dc4be78c7de?s=500",
     "location":"San Diego, CA",
     "bio":"Trey Hunner helps Python developers level-up their skills through his weekly Python skill-building service, [Python Morsels](https://www.pythonmorsels.com/). He also helps teams turn experienced developers into experienced Python developers through on-site Python training workshops and courses.",
     "twitter":"treyhunner",
     "url":"http://treyhunner.com",
     "organization":"Truthful Technology, LLC",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"How Functions in Python are Different",
     "abstract":"Folks moving to Python from another programming language often find that Python's functions don't work quite the way they'd expect.  In this talk we're going to take a look at how Python's functions differ from functions in many other popular programming languages.",
     "audience_level":"All",
     "tags":[
        "python",
        "functions",
        "scope",
        "decorators",
        "best practices",
        "idioms"
     ],
     "state":"declined",
     "confirmed":false,
     "created_at":"2019-03-14T21:51:18.784Z",
     "additional_info":null
  },
  {
     "name":"Moshe Zadka",
     "avatar":"https://secure.gravatar.com/avatar/0d65dbd2d816a5af0899c4f9739eb7cf?s=500",
     "location":"Unknown",
     "bio":"Moshe is a core Twisted contributor, and has contributed to core Python. He has building and deploying web applications since 2001.\r\n",
     "twitter":"moshezadka",
     "url":"https://orbifold.xyz",
     "organization":"Twisted",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Boring Object Orientation",
     "abstract":"The strengths and weaknesses of Python lend themselves to a different style of object oriented programming. By accepting several constraints on how we design and implement classes, we make our code more robust, more testable, and easier to adapt to changing circumstances.",
     "audience_level":"Intermediate",
     "tags":[
        "python",
        "fundamentals",
        "oop",
        "ood",
        "design"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-15T02:37:46.972Z",
     "additional_info":null
  },
  {
     "name":"Jordan Hagan",
     "avatar":"https://secure.gravatar.com/avatar/a3c9af5e468ccde3103310d4d3fe1992?s=500",
     "location":"Greater Denver Area",
     "bio":"Jordan Hagan is a Senior Data Scientist with Miner & Kasch. She started her career in 2010 as a government subcontractor working with the OIG/DOJ providing analytic insights to support Medicare Part D fraud, waste, and abuse cases. With expansive healthcare domain knowledge, Jordan has worked closely with hospitals across the United States to build data-driven systems to improve patient outcomes, parse surgeons' notes, and streamline provider workflows to ensure the highest quality of care. Recently expanding beyond healthcare, she has built workflows to help companies identify customers for personalized retention and marketing efforts powered by recommendation engines and prediction algorithms. Residing in Denver, Colorado, Jordan spends her free time exploring the mountains and sampling great beer.",
     "twitter":"JtotheHagan",
     "url":"https://www.linkedin.com/in/jordanhhagan/",
     "organization":"Miner & Kasch",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Optimizing SQL + Python Pipelines for Data Science",
     "abstract":"Poorly written SQL and Python can make data extraction and manipulation tedious and painful. Streamlined processes utilizing SQL best practices will save hours of frustration. My goal is to teach attendees proven SQL methodologies and what python tools to use when.",
     "audience_level":"All",
     "tags":[
        "SQL",
        "Python",
        "data science",
        "big data"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-01T03:48:45.776Z",
     "additional_info":null
  },
  {
     "name":"Veronica Hanus",
     "avatar":"https://secure.gravatar.com/avatar/ee3eee2d4ac16bb01ad5bf6704029900?s=500",
     "location":"Unknown",
     "bio":"Before becoming a programmer, Veronica was a researcher with an eye for process improvement (she helped pick the Mars Curiosity Rover's landing site!). She loves exploring the web and teaching, and speaks on building the tooling & docs you need and has co-taught a PyCon tutorial on using web-scraping and machine learning to predict Oscar winners. When she isn't thinking about how the web can be better for developers, she enjoys blogging and snuggling as many cats as possible.\r\n\r\nPast speaking experience:\r\n\r\n**Technical presentations**\r\n\r\n* \"To comment or not to comment? Conflicting attitudes towards commenting and beginner pain\"    (this talk), Flatiron NYC (March, 2019)\r\n* \"Git 'Hooked' on images in your version control and up your documentation game\", Git Merge (Belgium, Feb. 2019), PyTennessee (Feb. 2019), PyCaribbean (Feb. 2019)\r\n* Workshop on \"Git 'Hooked' on images in your version control and up your documentation\", Flatiron NYC (Jan. 2019)\r\n* “Imagining Colors is Hard: Representing Visual Changes in Version Control”, Hacktoberfest NYC 2018 | [slides](https://bit.ly/2C7uNFI)   \r\n* Assisted in teaching “Lights Camera Action! Scrape, explore, and model to predict Oscar winners & box office hits” tutorial at PyCon 2018 | [description](https://us.pycon.org/2018/schedule/presentation/48/) | [bio](https://us.pycon.org/2018/speaker/profile/337/) | [video](https://www.youtube.com/watch?v=XMtygcrqHqo) | [materials](https://github.com/dhanus/oscars-tutorial/blob/master/Part1-Scraping-Box-Office-Hits.ipynb) |\r\n* “Using Unix to make your time in the terminal better” at NYC Women's Work Jelly 2017 | [project page](https://github.com/vzhz/friendly_terminal) |\r\n* Assisted in teaching “Python for Data Science” tutorial at Boston Code Camp 27 (2016) | [description](https://www.bostoncodecamp.com/CC26/sessions/details/16421) | [materials](https://github.com/swzCuroverse/BostonCodeCamp26) |\r\n* “Giving Imposter Syndrome the Kick in the Pants It Deserves” at NYC Women's Work Jelly 2016 | [slides](https://docs.google.com/presentation/d/18IB_3lKaUcEqShqjqRn62Jc5XGqhevQnfncPPD7cA18/edit) |\r\n* Workshop “LaTeX: Academic Typesetting for Industry” at Recurse Center 2015 | [materials](https://github.com/vzhz/LaTeXresources) |\r\n\r\n**Teaching experience**\r\n\r\n* SAT Writing Instructor for MIT Academic Teaching Initiative 2011-2012\r\nDeveloped & taught 12-week SAT Writing course • Median 50% showed a 200 point increase during the course • A few students even contacted me as they were writing college entrance essays\r\n\r\n* Programming Coach for Bootstrap Afterschool Program 2011-2012\r\nProvided 1-on-1 and group instruction for 14 middle-school students in creating their own games • Used functional programming (Scheme) and pair programming to teach algebraic concepts (Pythagorean theorem & writing appropriate algebraic functions) and programming concepts (problem solving using the Design Recipe, data types, Boolean logic, conditional branching, functions & variables)\r\n\r\n**Research-related presentations/communication**\r\n\r\n* Presented findings of safety tests of malfunctioning equipment to lab at MIT Paleomagnetism Laboratory 2012 \r\n* Presented findings to internal committee / communicated intern project needs to software developer at NASA JPL 2009\r\n• Led student effort to find rock distributions of landing sites for Curiosity rover • Introduced three students to in-house software for QA element of our project, including reporting procedures, and software process and limitations",
     "twitter":"veronica_hanus",
     "url":"https://vzhz.github.io/blog.html",
     "organization":"",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"To comment or not? A data-driven look at attitudes toward code comments",
     "abstract":"How can someone who is just learning find the commenting style that is best for them as they learn, grow, & contribute? I did a survey of programmers & will be sharing what we can do to address comment use in a way that encourages a growth mindset and empowers everyone.",
     "audience_level":"All",
     "tags":[
        "documentation",
        "learning",
        "supporting beginning programers",
        "best practices",
        "data",
        "data-driven"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-13T03:27:06.810Z",
     "additional_info":null
  },
  {
     "name":"Gabriel Boorse",
     "avatar":"https://secure.gravatar.com/avatar/3dfa9aea7d1f8f9302884036f0893ef3?s=500",
     "location":"Unknown",
     "bio":"Gabriel works remotely for a San Francisco startup as a Senior Software Engineer and primarily uses JVM languages to get the job done. He has been, however, a longtime supporter of the Python community and enjoys writing Python wherever possible. Ask him about the pros and cons of Java versus Python and why he thinks that light themes are truly the better choice!",
     "twitter":"gnboorse",
     "url":"https://gnboor.se",
     "organization":"",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Unleashing the Eighth Plague: An Intro to Load Testing with Locust and Python",
     "abstract":"Puzzling over performance problems in production? Baffling backend bugs bending your brain? Unleash a plague of Locusts on your web app to devour performance problems, permanently! In this talk, you will learn how to leverage Locust for load testing RESTful services and more.",
     "audience_level":"All",
     "tags":[
        "devops",
        "testing",
        "api",
        "web development",
        "Python",
        "Locust",
        "load testing",
        "performance"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-13T01:49:12.522Z",
     "additional_info":null
  },
  {
     "name":"Joseph Willi",
     "avatar":"https://secure.gravatar.com/avatar/95568ffe6e44f372be3cd18fd4182afb?s=500",
     "location":"Unknown",
     "bio":"Joseph Willi works as a Research Engineer with the Underwriters Laboratories Firefighter Safety Research Institute (FSRI), a group dedicated to increasing firefighter knowledge to reduce injuries and deaths in the fire service and communities they serve. Along with other members of the FSRI team, Joe regularly utilizes Python for his work, most frequently during the data acquisition and analysis portions of research projects. Additionally, he has incorporated Python into projects involving image analysis and object detection applications. Joseph holds a bachelor's degree in General Engineering from the University of Illinois at Urbana-Champaign as well as a master's degree in Fire Protection Engineering from the University of Maryland, College Park.",
     "twitter":"",
     "url":"https://ulfirefightersafety.org/",
     "organization":"Underwriters Laboratories",
     "talk_format":"Talk (~30-45 minutes)",
     "title":"Using Dash to Create Interactive Web Apps for Non-Technical Audiences",
     "abstract":"Ever struggle with finding methods to present data visualizations and/or results to non-technical audiences in a coherent and engaging manner? In this talk, I'll detail how I overcame such a challenge by using Dash to build an interactive app for firefighters to use while testing rescue equipment.",
     "audience_level":"All",
     "tags":[
        "Dash",
        "Python",
        "data science"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-09T23:34:08.583Z",
     "additional_info":null
  },
  {
     "name":"Grishma Jena",
     "avatar":"https://secure.gravatar.com/avatar/4f25eff0c4817bd23f912356192509af?s=500",
     "location":"San Francisco",
     "bio":"Grishma is a Cognitive Software Engineer with the Data Science for Marketing team at IBM Watson in San Francisco. She earned her Masters in Computer Science at University of Pennsylvania. Her research interests are in Machine Learning and Natural Language Processing. She was recently a mentor for AI4ALL's AI Project Fellowship Spring 2018 where she guided a group of high school students to use AI for prioritizing 911 EMS calls. In her free time, she writes, cooks and likes conducting workshops and delivering talks. She likes explaining things in an easy-to-understand format, drawing analogies from real-life (eg. using Uncle Scrooge to explain Greedy Algorithms https://medium.com/the-graph/uncle-scrooge-meets-greedy-algorithms-dfc80c33d7ac). https://www.linkedin.com/in/grishmajena/",
     "twitter":"DebateLover",
     "url":"https://gjena.github.io/",
     "organization":"IBM",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"A hands-on introduction to Natural Language Processing in Python",
     "abstract":"This workshop introduces Natural Language Processing in Python. Attendees learn how to process text with NLTK and Gensim to derive useful insights. Foundational concepts like tokenization and part of speech tagging and complex topics like Word2Vec, sentiment analysis and topic modeling are covered.",
     "audience_level":"Intermediate",
     "tags":[
        "Python",
        "Workshop",
        "data science",
        "machine learning"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-13T21:04:27.575Z",
     "additional_info":null
  },
  {
     "name":"Mike Solomon",
     "avatar":"https://secure.gravatar.com/avatar/79f08f2d3f1cc7ab155f738de7c90bc3?s=500",
     "location":"Unknown",
     "bio":"Mike Solomon is the founder and CEO of Meeshkan (meeshkan.com), a Helsinki-based DevOps company. A music major at Stanford University, Queen's University Belfast and the University of Florida, Mike has been a guest researcher at the University of Paris VI and has held the post of artistic director of the Ensemble 101 (ensemble101.fr) from 2011 until the present day. While working at the IRCAM as a computer music designer, he fell in love with Machine Learning and founded Meeshkan to ease several DevOps pain points in the ML pipeline. Since then, Meeshkan has expanded to other areas of DevOps, including API testing with unmock (unmock.io).",
     "twitter":"",
     "url":"",
     "organization":"Meeshkan Machine Learning",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"Testing apps with third-party API integrations",
     "abstract":"Reliance on third-party services has become a real pain point and developers demand modern ways to mock these services for both dev/staging environments and testing.  We will examine (inc. live coding) best practices to develop and test apps that make heavy use of third-party API integrations.",
     "audience_level":"Advanced",
     "tags":[
        "Python",
        "testing",
        "api",
        "workshops"
     ],
     "state":"accepted",
     "confirmed":false,
     "created_at":"2019-05-05T19:42:26.790Z",
     "additional_info":null
  },
  {
     "name":"Uche Ogbuji",
     "avatar":"https://secure.gravatar.com/avatar/d4aee6e9dca9f6cf4ba52e78081a9093?s=500",
     "location":"Superior, CO",
     "bio":"Uche Ogbuji, more properly Úchèńnà Ogbújí, was born in Calabar, Nigeria. He lived in Egypt, England and elsewhere before settling near Boulder, Colorado. He is an Electronic Engineer by education, having started his courses in Nigeria before transferring and graduating in the US. He is co-founder and CTO of Zepheira, which develops technological solutions to increase libraries' relevance on the Web. Uche has pioneered work data architecture and distributed systems for almost three decades, including early contributions to XML, Linked Data and Web services, having published hundreds of technical articles in industry journals such as IBM developerWorks, Application Development Trends & XML.com.\r\n\r\nUche is also a poet and spoken word performer. His poetry chapbook, *[Ndewo, Colorado](http://uche.ogbuji.net/ndewo)* is a Colorado Book Award Winner, and a [Westword Award Winner (\"Best Environmental Poetry\")](http://www.westword.com/best-of/2015/arts-and-entertainment/best-environmental-poetry-6611142). His poems, published worldwide, fuse Igbo culture, European classicism, American Mountain West setting, and Hip-Hop.",
     "twitter":"uogbuji",
     "url":"http://uche.ogbuji.net/",
     "organization":"Zepheira",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"Iterators, generators, coroutines and asyncio",
     "abstract":"Python developers should learn effective use of the iterator protocol when crunching large datasets. The lineage of such techniques extends to Python 3's asyncio, valuable in boosting network applications. This workshop progresses from a firm grounding in iterators through generators & asyncio.",
     "audience_level":"Intermediate",
     "tags":[
        "Python",
        "big data",
        "performance",
        "multitasking",
        "python3",
        "workshops"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-16T15:10:08.389Z",
     "additional_info":null
  },
  {
     "name":"Chris Luiz",
     "avatar":"https://secure.gravatar.com/avatar/3e78f0a670ad0fd55153a2ac6fc703af?s=500",
     "location":"Unknown",
     "bio":"Chris Luiz is a data scientist, a three time startup vet, the former co-founder and organizer of PyData Denver, and an alum of Galvanize's Data Science Immersive. Currently, he works at Progressive insurance building intelligent applications and instructing others on how to do so.  Outside of work Chris enjoys spending time with his wife and four children, gardening, and beekeeping.",
     "twitter":"CRLuiz",
     "url":"",
     "organization":"",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"Full Stack Data Science: Building Your First Smart Application",
     "abstract":"This workshop delivers value for beginners, web developers, and data scientists via an intro to the Python scientific and data analysis stack, Flask, data acquisition/processing, and a means to knit them together. It is widely accessible and touches on several interests of the community.",
     "audience_level":"Intermediate",
     "tags":[
        "workshops"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-14T16:37:07.693Z",
     "additional_info":null
  },
  {
     "name":"Scott Stoltzman",
     "avatar":"https://secure.gravatar.com/avatar/1f27489cee7567a0d36ba1314545ceb4?s=500",
     "location":"Unknown",
     "bio":"### About Me\r\n\r\nI live in the beautiful city of Fort Collins, CO where I am a husband and father as well as a data scientist. In my spare time I like to go hiking, backpacking, biking, snowshoeing and enjoy building furniture.  \r\n\r\n#### My Experience  \r\n\r\nI have worked in the field of analytics and statistical modeling for ~10 years and love to teach. I have run my own consulting business for the last three years and have helped 12 companies grow analytics platforms from the ground up and introduced machine learning techniques into production environments.  I run the Fort Collins Data Science Meetup group. We meet weekly, so we'd love to have anyone interested come on up and join the fun!",
     "twitter":"stoltzmaniac",
     "url":"https://www.stoltzmanconsulting.com",
     "organization":"Stoltzman Consulting",
     "talk_format":"Workshop (~ 3 hours)",
     "title":"Collaborative Data Science with Docker Compose",
     "abstract":"Data scientists and analysts need a common set of tools and data in order to be successful.\n\nIn this tutorial, you will learn how to create and deploy a full-stack application with Docker Compose in order to bring together four great tools: Flask, PostgreSQL, MongoDB, and JupyterLab.",
     "audience_level":"Intermediate",
     "tags":[
        "data science",
        "Python",
        "flask",
        "api",
        "JupyterLab",
        "Jupyter Notebooks",
        "Docker",
        "workshops"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-04-13T15:36:07.307Z",
     "additional_info":null
  },
  {
     "name":"Paul Everitt",
     "avatar":"https://secure.gravatar.com/avatar/44090fd9e2332fae04c28cb208af1f34?s=500",
     "location":"Unknown",
     "bio":"Paul is the PyCharm Developer Advocate at JetBrains. Before that, Paul was a co-founder of Zope Corporation, taking the first open source application server through $14M of funding. Paul has bootstrapped both the Python Software Foundation and the Plone Foundation. Paul was an officer in the US Navy, starting www.navy.mil in 1993.\r\n",
     "twitter":"paulweveritt",
     "url":"",
     "organization":"JetBrains",
     "talk_format":"Keynote",
     "title":"Python 1994",
     "abstract":"\"Come for the language, stay for the community.\" The Python community started in 1994 at a NIST workshop in Maryland. What was the world of Python like in its first years? Did we have any clue whatsoever? A joke-focused tour of early Python, heavy on question-and-answer.",
     "audience_level":"All",
     "tags":[
        "python",
        "community"
     ],
     "state":"accepted",
     "confirmed":true,
     "created_at":"2019-05-13T13:32:26.541Z",
     "additional_info":null
  },
  {
    "name":"Lynn Root",
    "avatar":"",
    "location":"Unknown",
    "bio":"",
    "twitter":"",
    "url":"",
    "organization":"Spotify",
    "talk_format":"Talk (~30-45 minutes)",
    "title":"Advanced asyncio: Solving Real-World Production Problems",
    "abstract":"By building a simplified chaos monkey service, we will walk through how to create a good foundation for an asyncio-based service, including graceful shutdowns, proper exception handling, and testing asynchronous code. We'll get into the hairier topics as well, covering topics like working with synchronous code, debugging and profiling, and working with threaded code. We'll learn how to approach asynchronous and concurrent programming with Python's asyncio library, take away some best practices, and learn what pitfalls to avoid.",
    "audience_level":"",
    "tags":[],
    "state":"accepted",
    "confirmed":true,
    "created_at":"2019-05-13T13:32:26.541Z",
    "additional_info":null
 },
 {
   "name":"Ewa Jodlowska",
   "avatar":"",
   "location":"Unknown",
   "bio":"",
   "twitter":"",
   "url":"",
   "organization":"Python Software Foundation",
   "talk_format":"Keynote",
   "title":"TBD",
   "abstract":"",
   "audience_level":"",
   "tags":[],
   "state":"accepted",
   "confirmed":true,
   "created_at":"2019-05-13T13:32:26.541Z",
   "additional_info":null
}
]